Revit 2027 API
ExporterIFCUtils.GetGeometryFromInplaceWall Method
 Obtains a special snapshot of the geometry of an in-place wall element suitable for export.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static GeometryElement GetGeometryFromInplaceWall(
	FamilyInstance pFamInstWallElem
)
Public Shared Function GetGeometryFromInplaceWall (
	pFamInstWallElem As FamilyInstance
) As GeometryElement
public:
static GeometryElement^ GetGeometryFromInplaceWall(
	FamilyInstance^ pFamInstWallElem
)
static member GetGeometryFromInplaceWall :
        pFamInstWallElem : FamilyInstance -> GeometryElement
Parameters
pFamInstWallElem FamilyInstance
 The in-place wall instance.
Return Value
GeometryElement
 The in-place wall geometry. Returns null if there is no special geometry for the wall needed for export; the standard geometry of the wall can be used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace